Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/twihs.h
/*
 * Component description for TWIHS
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_TWIHS_COMPONENT_H_
#define _SAMA5D_TWIHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TWIHS                                        */
/* ************************************************************************** */

/* -------- TWIHS_CR : (TWIHS Offset: 0x00) ( /W 32) Control Register -------- */
#define TWIHS_CR_START_Pos                    _UINT32_(0)                                          /* (TWIHS_CR) Send a START Condition Position */
#define TWIHS_CR_START_Msk                    (_UINT32_(0x1) << TWIHS_CR_START_Pos)                /* (TWIHS_CR) Send a START Condition Mask */
#define TWIHS_CR_START(value)                 (TWIHS_CR_START_Msk & (_UINT32_(value) << TWIHS_CR_START_Pos)) /* Assigment of value for START in the TWIHS_CR register */
#define TWIHS_CR_STOP_Pos                     _UINT32_(1)                                          /* (TWIHS_CR) Send a STOP Condition Position */
#define TWIHS_CR_STOP_Msk                     (_UINT32_(0x1) << TWIHS_CR_STOP_Pos)                 /* (TWIHS_CR) Send a STOP Condition Mask */
#define TWIHS_CR_STOP(value)                  (TWIHS_CR_STOP_Msk & (_UINT32_(value) << TWIHS_CR_STOP_Pos)) /* Assigment of value for STOP in the TWIHS_CR register */
#define TWIHS_CR_MSEN_Pos                     _UINT32_(2)                                          /* (TWIHS_CR) TWIHS Master Mode Enabled Position */
#define TWIHS_CR_MSEN_Msk                     (_UINT32_(0x1) << TWIHS_CR_MSEN_Pos)                 /* (TWIHS_CR) TWIHS Master Mode Enabled Mask */
#define TWIHS_CR_MSEN(value)                  (TWIHS_CR_MSEN_Msk & (_UINT32_(value) << TWIHS_CR_MSEN_Pos)) /* Assigment of value for MSEN in the TWIHS_CR register */
#define TWIHS_CR_MSDIS_Pos                    _UINT32_(3)                                          /* (TWIHS_CR) TWIHS Master Mode Disabled Position */
#define TWIHS_CR_MSDIS_Msk                    (_UINT32_(0x1) << TWIHS_CR_MSDIS_Pos)                /* (TWIHS_CR) TWIHS Master Mode Disabled Mask */
#define TWIHS_CR_MSDIS(value)                 (TWIHS_CR_MSDIS_Msk & (_UINT32_(value) << TWIHS_CR_MSDIS_Pos)) /* Assigment of value for MSDIS in the TWIHS_CR register */
#define TWIHS_CR_SVEN_Pos                     _UINT32_(4)                                          /* (TWIHS_CR) TWIHS Slave Mode Enabled Position */
#define TWIHS_CR_SVEN_Msk                     (_UINT32_(0x1) << TWIHS_CR_SVEN_Pos)                 /* (TWIHS_CR) TWIHS Slave Mode Enabled Mask */
#define TWIHS_CR_SVEN(value)                  (TWIHS_CR_SVEN_Msk & (_UINT32_(value) << TWIHS_CR_SVEN_Pos)) /* Assigment of value for SVEN in the TWIHS_CR register */
#define TWIHS_CR_SVDIS_Pos                    _UINT32_(5)                                          /* (TWIHS_CR) TWIHS Slave Mode Disabled Position */
#define TWIHS_CR_SVDIS_Msk                    (_UINT32_(0x1) << TWIHS_CR_SVDIS_Pos)                /* (TWIHS_CR) TWIHS Slave Mode Disabled Mask */
#define TWIHS_CR_SVDIS(value)                 (TWIHS_CR_SVDIS_Msk & (_UINT32_(value) << TWIHS_CR_SVDIS_Pos)) /* Assigment of value for SVDIS in the TWIHS_CR register */
#define TWIHS_CR_QUICK_Pos                    _UINT32_(6)                                          /* (TWIHS_CR) SMBus Quick Command Position */
#define TWIHS_CR_QUICK_Msk                    (_UINT32_(0x1) << TWIHS_CR_QUICK_Pos)                /* (TWIHS_CR) SMBus Quick Command Mask */
#define TWIHS_CR_QUICK(value)                 (TWIHS_CR_QUICK_Msk & (_UINT32_(value) << TWIHS_CR_QUICK_Pos)) /* Assigment of value for QUICK in the TWIHS_CR register */
#define TWIHS_CR_SWRST_Pos                    _UINT32_(7)                                          /* (TWIHS_CR) Software Reset Position */
#define TWIHS_CR_SWRST_Msk                    (_UINT32_(0x1) << TWIHS_CR_SWRST_Pos)                /* (TWIHS_CR) Software Reset Mask */
#define TWIHS_CR_SWRST(value)                 (TWIHS_CR_SWRST_Msk & (_UINT32_(value) << TWIHS_CR_SWRST_Pos)) /* Assigment of value for SWRST in the TWIHS_CR register */
#define TWIHS_CR_HSEN_Pos                     _UINT32_(8)                                          /* (TWIHS_CR) TWIHS High-Speed Mode Enabled Position */
#define TWIHS_CR_HSEN_Msk                     (_UINT32_(0x1) << TWIHS_CR_HSEN_Pos)                 /* (TWIHS_CR) TWIHS High-Speed Mode Enabled Mask */
#define TWIHS_CR_HSEN(value)                  (TWIHS_CR_HSEN_Msk & (_UINT32_(value) << TWIHS_CR_HSEN_Pos)) /* Assigment of value for HSEN in the TWIHS_CR register */
#define TWIHS_CR_HSDIS_Pos                    _UINT32_(9)                                          /* (TWIHS_CR) TWIHS High-Speed Mode Disabled Position */
#define TWIHS_CR_HSDIS_Msk                    (_UINT32_(0x1) << TWIHS_CR_HSDIS_Pos)                /* (TWIHS_CR) TWIHS High-Speed Mode Disabled Mask */
#define TWIHS_CR_HSDIS(value)                 (TWIHS_CR_HSDIS_Msk & (_UINT32_(value) << TWIHS_CR_HSDIS_Pos)) /* Assigment of value for HSDIS in the TWIHS_CR register */
#define TWIHS_CR_SMBEN_Pos                    _UINT32_(10)                                         /* (TWIHS_CR) SMBus Mode Enabled Position */
#define TWIHS_CR_SMBEN_Msk                    (_UINT32_(0x1) << TWIHS_CR_SMBEN_Pos)                /* (TWIHS_CR) SMBus Mode Enabled Mask */
#define TWIHS_CR_SMBEN(value)                 (TWIHS_CR_SMBEN_Msk & (_UINT32_(value) << TWIHS_CR_SMBEN_Pos)) /* Assigment of value for SMBEN in the TWIHS_CR register */
#define TWIHS_CR_SMBDIS_Pos                   _UINT32_(11)                                         /* (TWIHS_CR) SMBus Mode Disabled Position */
#define TWIHS_CR_SMBDIS_Msk                   (_UINT32_(0x1) << TWIHS_CR_SMBDIS_Pos)               /* (TWIHS_CR) SMBus Mode Disabled Mask */
#define TWIHS_CR_SMBDIS(value)                (TWIHS_CR_SMBDIS_Msk & (_UINT32_(value) << TWIHS_CR_SMBDIS_Pos)) /* Assigment of value for SMBDIS in the TWIHS_CR register */
#define TWIHS_CR_PECEN_Pos                    _UINT32_(12)                                         /* (TWIHS_CR) Packet Error Checking Enable Position */
#define TWIHS_CR_PECEN_Msk                    (_UINT32_(0x1) << TWIHS_CR_PECEN_Pos)                /* (TWIHS_CR) Packet Error Checking Enable Mask */
#define TWIHS_CR_PECEN(value)                 (TWIHS_CR_PECEN_Msk & (_UINT32_(value) << TWIHS_CR_PECEN_Pos)) /* Assigment of value for PECEN in the TWIHS_CR register */
#define TWIHS_CR_PECDIS_Pos                   _UINT32_(13)                                         /* (TWIHS_CR) Packet Error Checking Disable Position */
#define TWIHS_CR_PECDIS_Msk                   (_UINT32_(0x1) << TWIHS_CR_PECDIS_Pos)               /* (TWIHS_CR) Packet Error Checking Disable Mask */
#define TWIHS_CR_PECDIS(value)                (TWIHS_CR_PECDIS_Msk & (_UINT32_(value) << TWIHS_CR_PECDIS_Pos)) /* Assigment of value for PECDIS in the TWIHS_CR register */
#define TWIHS_CR_PECRQ_Pos                    _UINT32_(14)                                         /* (TWIHS_CR) PEC Request Position */
#define TWIHS_CR_PECRQ_Msk                    (_UINT32_(0x1) << TWIHS_CR_PECRQ_Pos)                /* (TWIHS_CR) PEC Request Mask */
#define TWIHS_CR_PECRQ(value)                 (TWIHS_CR_PECRQ_Msk & (_UINT32_(value) << TWIHS_CR_PECRQ_Pos)) /* Assigment of value for PECRQ in the TWIHS_CR register */
#define TWIHS_CR_CLEAR_Pos                    _UINT32_(15)                                         /* (TWIHS_CR) Bus CLEAR Command Position */
#define TWIHS_CR_CLEAR_Msk                    (_UINT32_(0x1) << TWIHS_CR_CLEAR_Pos)                /* (TWIHS_CR) Bus CLEAR Command Mask */
#define TWIHS_CR_CLEAR(value)                 (TWIHS_CR_CLEAR_Msk & (_UINT32_(value) << TWIHS_CR_CLEAR_Pos)) /* Assigment of value for CLEAR in the TWIHS_CR register */
#define TWIHS_CR_ACMEN_Pos                    _UINT32_(16)                                         /* (TWIHS_CR) Alternative Command Mode Enable Position */
#define TWIHS_CR_ACMEN_Msk                    (_UINT32_(0x1) << TWIHS_CR_ACMEN_Pos)                /* (TWIHS_CR) Alternative Command Mode Enable Mask */
#define TWIHS_CR_ACMEN(value)                 (TWIHS_CR_ACMEN_Msk & (_UINT32_(value) << TWIHS_CR_ACMEN_Pos)) /* Assigment of value for ACMEN in the TWIHS_CR register */
#define TWIHS_CR_ACMDIS_Pos                   _UINT32_(17)                                         /* (TWIHS_CR) Alternative Command Mode Disable Position */
#define TWIHS_CR_ACMDIS_Msk                   (_UINT32_(0x1) << TWIHS_CR_ACMDIS_Pos)               /* (TWIHS_CR) Alternative Command Mode Disable Mask */
#define TWIHS_CR_ACMDIS(value)                (TWIHS_CR_ACMDIS_Msk & (_UINT32_(value) << TWIHS_CR_ACMDIS_Pos)) /* Assigment of value for ACMDIS in the TWIHS_CR register */
#define TWIHS_CR_THRCLR_Pos                   _UINT32_(24)                                         /* (TWIHS_CR) Transmit Holding Register Clear Position */
#define TWIHS_CR_THRCLR_Msk                   (_UINT32_(0x1) << TWIHS_CR_THRCLR_Pos)               /* (TWIHS_CR) Transmit Holding Register Clear Mask */
#define TWIHS_CR_THRCLR(value)                (TWIHS_CR_THRCLR_Msk & (_UINT32_(value) << TWIHS_CR_THRCLR_Pos)) /* Assigment of value for THRCLR in the TWIHS_CR register */
#define TWIHS_CR_LOCKCLR_Pos                  _UINT32_(26)                                         /* (TWIHS_CR) Lock Clear Position */
#define TWIHS_CR_LOCKCLR_Msk                  (_UINT32_(0x1) << TWIHS_CR_LOCKCLR_Pos)              /* (TWIHS_CR) Lock Clear Mask */
#define TWIHS_CR_LOCKCLR(value)               (TWIHS_CR_LOCKCLR_Msk & (_UINT32_(value) << TWIHS_CR_LOCKCLR_Pos)) /* Assigment of value for LOCKCLR in the TWIHS_CR register */
#define TWIHS_CR_FIFOEN_Pos                   _UINT32_(28)                                         /* (TWIHS_CR) FIFO Enable Position */
#define TWIHS_CR_FIFOEN_Msk                   (_UINT32_(0x1) << TWIHS_CR_FIFOEN_Pos)               /* (TWIHS_CR) FIFO Enable Mask */
#define TWIHS_CR_FIFOEN(value)                (TWIHS_CR_FIFOEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the TWIHS_CR register */
#define TWIHS_CR_FIFODIS_Pos                  _UINT32_(29)                                         /* (TWIHS_CR) FIFO Disable Position */
#define TWIHS_CR_FIFODIS_Msk                  (_UINT32_(0x1) << TWIHS_CR_FIFODIS_Pos)              /* (TWIHS_CR) FIFO Disable Mask */
#define TWIHS_CR_FIFODIS(value)               (TWIHS_CR_FIFODIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFODIS_Pos)) /* Assigment of value for FIFODIS in the TWIHS_CR register */
#define TWIHS_CR_Msk                          _UINT32_(0x3503FFFF)                                 /* (TWIHS_CR) Register Mask  */

/* FIFO_ENABLED mode */
#define TWIHS_CR_FIFO_ENABLED_START_Pos       _UINT32_(0)                                          /* (TWIHS_CR) Send a START Condition Position */
#define TWIHS_CR_FIFO_ENABLED_START_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_START_Pos)   /* (TWIHS_CR) Send a START Condition Mask */
#define TWIHS_CR_FIFO_ENABLED_START(value)    (TWIHS_CR_FIFO_ENABLED_START_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_START_Pos))
#define TWIHS_CR_FIFO_ENABLED_STOP_Pos        _UINT32_(1)                                          /* (TWIHS_CR) Send a STOP Condition Position */
#define TWIHS_CR_FIFO_ENABLED_STOP_Msk        (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_STOP_Pos)    /* (TWIHS_CR) Send a STOP Condition Mask */
#define TWIHS_CR_FIFO_ENABLED_STOP(value)     (TWIHS_CR_FIFO_ENABLED_STOP_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_STOP_Pos))
#define TWIHS_CR_FIFO_ENABLED_MSEN_Pos        _UINT32_(2)                                          /* (TWIHS_CR) TWIHS Master Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_MSEN_Msk        (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_MSEN_Pos)    /* (TWIHS_CR) TWIHS Master Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_MSEN(value)     (TWIHS_CR_FIFO_ENABLED_MSEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_MSEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_MSDIS_Pos       _UINT32_(3)                                          /* (TWIHS_CR) TWIHS Master Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_MSDIS_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_MSDIS_Pos)   /* (TWIHS_CR) TWIHS Master Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_MSDIS(value)    (TWIHS_CR_FIFO_ENABLED_MSDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_MSDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_SVEN_Pos        _UINT32_(4)                                          /* (TWIHS_CR) TWIHS Slave Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_SVEN_Msk        (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_SVEN_Pos)    /* (TWIHS_CR) TWIHS Slave Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SVEN(value)     (TWIHS_CR_FIFO_ENABLED_SVEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_SVEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_SVDIS_Pos       _UINT32_(5)                                          /* (TWIHS_CR) TWIHS Slave Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_SVDIS_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_SVDIS_Pos)   /* (TWIHS_CR) TWIHS Slave Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SVDIS(value)    (TWIHS_CR_FIFO_ENABLED_SVDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_SVDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_QUICK_Pos       _UINT32_(6)                                          /* (TWIHS_CR) SMBus Quick Command Position */
#define TWIHS_CR_FIFO_ENABLED_QUICK_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_QUICK_Pos)   /* (TWIHS_CR) SMBus Quick Command Mask */
#define TWIHS_CR_FIFO_ENABLED_QUICK(value)    (TWIHS_CR_FIFO_ENABLED_QUICK_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_QUICK_Pos))
#define TWIHS_CR_FIFO_ENABLED_SWRST_Pos       _UINT32_(7)                                          /* (TWIHS_CR) Software Reset Position */
#define TWIHS_CR_FIFO_ENABLED_SWRST_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_SWRST_Pos)   /* (TWIHS_CR) Software Reset Mask */
#define TWIHS_CR_FIFO_ENABLED_SWRST(value)    (TWIHS_CR_FIFO_ENABLED_SWRST_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_SWRST_Pos))
#define TWIHS_CR_FIFO_ENABLED_HSEN_Pos        _UINT32_(8)                                          /* (TWIHS_CR) TWIHS High-Speed Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_HSEN_Msk        (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_HSEN_Pos)    /* (TWIHS_CR) TWIHS High-Speed Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_HSEN(value)     (TWIHS_CR_FIFO_ENABLED_HSEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_HSEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_HSDIS_Pos       _UINT32_(9)                                          /* (TWIHS_CR) TWIHS High-Speed Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_HSDIS_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_HSDIS_Pos)   /* (TWIHS_CR) TWIHS High-Speed Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_HSDIS(value)    (TWIHS_CR_FIFO_ENABLED_HSDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_HSDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_SMBEN_Pos       _UINT32_(10)                                         /* (TWIHS_CR) SMBus Mode Enabled Position */
#define TWIHS_CR_FIFO_ENABLED_SMBEN_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_SMBEN_Pos)   /* (TWIHS_CR) SMBus Mode Enabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SMBEN(value)    (TWIHS_CR_FIFO_ENABLED_SMBEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_SMBEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos      _UINT32_(11)                                         /* (TWIHS_CR) SMBus Mode Disabled Position */
#define TWIHS_CR_FIFO_ENABLED_SMBDIS_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos)  /* (TWIHS_CR) SMBus Mode Disabled Mask */
#define TWIHS_CR_FIFO_ENABLED_SMBDIS(value)   (TWIHS_CR_FIFO_ENABLED_SMBDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_SMBDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECEN_Pos       _UINT32_(12)                                         /* (TWIHS_CR) Packet Error Checking Enable Position */
#define TWIHS_CR_FIFO_ENABLED_PECEN_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_PECEN_Pos)   /* (TWIHS_CR) Packet Error Checking Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_PECEN(value)    (TWIHS_CR_FIFO_ENABLED_PECEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_PECEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECDIS_Pos      _UINT32_(13)                                         /* (TWIHS_CR) Packet Error Checking Disable Position */
#define TWIHS_CR_FIFO_ENABLED_PECDIS_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_PECDIS_Pos)  /* (TWIHS_CR) Packet Error Checking Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_PECDIS(value)   (TWIHS_CR_FIFO_ENABLED_PECDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_PECDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_PECRQ_Pos       _UINT32_(14)                                         /* (TWIHS_CR) PEC Request Position */
#define TWIHS_CR_FIFO_ENABLED_PECRQ_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_PECRQ_Pos)   /* (TWIHS_CR) PEC Request Mask */
#define TWIHS_CR_FIFO_ENABLED_PECRQ(value)    (TWIHS_CR_FIFO_ENABLED_PECRQ_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_PECRQ_Pos))
#define TWIHS_CR_FIFO_ENABLED_CLEAR_Pos       _UINT32_(15)                                         /* (TWIHS_CR) Bus CLEAR Command Position */
#define TWIHS_CR_FIFO_ENABLED_CLEAR_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_CLEAR_Pos)   /* (TWIHS_CR) Bus CLEAR Command Mask */
#define TWIHS_CR_FIFO_ENABLED_CLEAR(value)    (TWIHS_CR_FIFO_ENABLED_CLEAR_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_CLEAR_Pos))
#define TWIHS_CR_FIFO_ENABLED_ACMEN_Pos       _UINT32_(16)                                         /* (TWIHS_CR) Alternative Command Mode Enable Position */
#define TWIHS_CR_FIFO_ENABLED_ACMEN_Msk       (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_ACMEN_Pos)   /* (TWIHS_CR) Alternative Command Mode Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_ACMEN(value)    (TWIHS_CR_FIFO_ENABLED_ACMEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_ACMEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos      _UINT32_(17)                                         /* (TWIHS_CR) Alternative Command Mode Disable Position */
#define TWIHS_CR_FIFO_ENABLED_ACMDIS_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos)  /* (TWIHS_CR) Alternative Command Mode Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_ACMDIS(value)   (TWIHS_CR_FIFO_ENABLED_ACMDIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_ACMDIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos      _UINT32_(24)                                         /* (TWIHS_CR) Transmit FIFO Clear Position */
#define TWIHS_CR_FIFO_ENABLED_TXFCLR_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos)  /* (TWIHS_CR) Transmit FIFO Clear Mask */
#define TWIHS_CR_FIFO_ENABLED_TXFCLR(value)   (TWIHS_CR_FIFO_ENABLED_TXFCLR_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_TXFCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos      _UINT32_(25)                                         /* (TWIHS_CR) Receive FIFO Clear Position */
#define TWIHS_CR_FIFO_ENABLED_RXFCLR_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos)  /* (TWIHS_CR) Receive FIFO Clear Mask */
#define TWIHS_CR_FIFO_ENABLED_RXFCLR(value)   (TWIHS_CR_FIFO_ENABLED_RXFCLR_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_RXFCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos     _UINT32_(26)                                         /* (TWIHS_CR) Transmit FIFO Lock CLEAR Position */
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR_Msk     (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos) /* (TWIHS_CR) Transmit FIFO Lock CLEAR Mask */
#define TWIHS_CR_FIFO_ENABLED_TXFLCLR(value)  (TWIHS_CR_FIFO_ENABLED_TXFLCLR_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_TXFLCLR_Pos))
#define TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos      _UINT32_(28)                                         /* (TWIHS_CR) FIFO Enable Position */
#define TWIHS_CR_FIFO_ENABLED_FIFOEN_Msk      (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos)  /* (TWIHS_CR) FIFO Enable Mask */
#define TWIHS_CR_FIFO_ENABLED_FIFOEN(value)   (TWIHS_CR_FIFO_ENABLED_FIFOEN_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_FIFOEN_Pos))
#define TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos     _UINT32_(29)                                         /* (TWIHS_CR) FIFO Disable Position */
#define TWIHS_CR_FIFO_ENABLED_FIFODIS_Msk     (_UINT32_(0x1) << TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos) /* (TWIHS_CR) FIFO Disable Mask */
#define TWIHS_CR_FIFO_ENABLED_FIFODIS(value)  (TWIHS_CR_FIFO_ENABLED_FIFODIS_Msk & (_UINT32_(value) << TWIHS_CR_FIFO_ENABLED_FIFODIS_Pos))
#define TWIHS_CR_FIFO_ENABLED_Msk             _UINT32_(0x3703FFFF)                                  /* (TWIHS_CR_FIFO_ENABLED) Register Mask  */


