Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/twihs.h
/* -------- TWIHS_CWGR : (TWIHS Offset: 0x10) (R/W 32) Clock Waveform Generator Register -------- */
#define TWIHS_CWGR_CLDIV_Pos                  _UINT32_(0)                                          /* (TWIHS_CWGR) Clock Low Divider Position */
#define TWIHS_CWGR_CLDIV_Msk                  (_UINT32_(0xFF) << TWIHS_CWGR_CLDIV_Pos)             /* (TWIHS_CWGR) Clock Low Divider Mask */
#define TWIHS_CWGR_CLDIV(value)               (TWIHS_CWGR_CLDIV_Msk & (_UINT32_(value) << TWIHS_CWGR_CLDIV_Pos)) /* Assigment of value for CLDIV in the TWIHS_CWGR register */
#define TWIHS_CWGR_CHDIV_Pos                  _UINT32_(8)                                          /* (TWIHS_CWGR) Clock High Divider Position */
#define TWIHS_CWGR_CHDIV_Msk                  (_UINT32_(0xFF) << TWIHS_CWGR_CHDIV_Pos)             /* (TWIHS_CWGR) Clock High Divider Mask */
#define TWIHS_CWGR_CHDIV(value)               (TWIHS_CWGR_CHDIV_Msk & (_UINT32_(value) << TWIHS_CWGR_CHDIV_Pos)) /* Assigment of value for CHDIV in the TWIHS_CWGR register */
#define TWIHS_CWGR_CKDIV_Pos                  _UINT32_(16)                                         /* (TWIHS_CWGR) Clock Divider Position */
#define TWIHS_CWGR_CKDIV_Msk                  (_UINT32_(0x7) << TWIHS_CWGR_CKDIV_Pos)              /* (TWIHS_CWGR) Clock Divider Mask */
#define TWIHS_CWGR_CKDIV(value)               (TWIHS_CWGR_CKDIV_Msk & (_UINT32_(value) << TWIHS_CWGR_CKDIV_Pos)) /* Assigment of value for CKDIV in the TWIHS_CWGR register */
#define TWIHS_CWGR_CKSRC_Pos                  _UINT32_(20)                                         /* (TWIHS_CWGR) Transfer Rate Clock Source Position */
#define TWIHS_CWGR_CKSRC_Msk                  (_UINT32_(0x1) << TWIHS_CWGR_CKSRC_Pos)              /* (TWIHS_CWGR) Transfer Rate Clock Source Mask */
#define TWIHS_CWGR_CKSRC(value)               (TWIHS_CWGR_CKSRC_Msk & (_UINT32_(value) << TWIHS_CWGR_CKSRC_Pos)) /* Assigment of value for CKSRC in the TWIHS_CWGR register */
#define   TWIHS_CWGR_CKSRC_PERIPH_CK_Val      _UINT32_(0x0)                                        /* (TWIHS_CWGR) Peripheral clock is used to generate the TWIHS baud rate.  */
#define   TWIHS_CWGR_CKSRC_GCLK_Val           _UINT32_(0x1)                                        /* (TWIHS_CWGR) GCLK is used to generate the TWIHS baud rate.  */
#define TWIHS_CWGR_CKSRC_PERIPH_CK            (TWIHS_CWGR_CKSRC_PERIPH_CK_Val << TWIHS_CWGR_CKSRC_Pos) /* (TWIHS_CWGR) Peripheral clock is used to generate the TWIHS baud rate. Position  */
#define TWIHS_CWGR_CKSRC_GCLK                 (TWIHS_CWGR_CKSRC_GCLK_Val << TWIHS_CWGR_CKSRC_Pos)  /* (TWIHS_CWGR) GCLK is used to generate the TWIHS baud rate. Position  */
#define TWIHS_CWGR_HOLD_Pos                   _UINT32_(24)                                         /* (TWIHS_CWGR) TWD Hold Time Versus TWCK Falling Position */
#define TWIHS_CWGR_HOLD_Msk                   (_UINT32_(0x1F) << TWIHS_CWGR_HOLD_Pos)              /* (TWIHS_CWGR) TWD Hold Time Versus TWCK Falling Mask */
#define TWIHS_CWGR_HOLD(value)                (TWIHS_CWGR_HOLD_Msk & (_UINT32_(value) << TWIHS_CWGR_HOLD_Pos)) /* Assigment of value for HOLD in the TWIHS_CWGR register */
#define TWIHS_CWGR_Msk                        _UINT32_(0x1F17FFFF)                                 /* (TWIHS_CWGR) Register Mask  */


/* -------- TWIHS_SR : (TWIHS Offset: 0x20) ( R/ 32) Status Register -------- */
#define TWIHS_SR_TXCOMP_Pos                   _UINT32_(0)                                          /* (TWIHS_SR) Transmission Completed (cleared by writing TWIHS_THR) Position */
#define TWIHS_SR_TXCOMP_Msk                   (_UINT32_(0x1) << TWIHS_SR_TXCOMP_Pos)               /* (TWIHS_SR) Transmission Completed (cleared by writing TWIHS_THR) Mask */
#define TWIHS_SR_TXCOMP(value)                (TWIHS_SR_TXCOMP_Msk & (_UINT32_(value) << TWIHS_SR_TXCOMP_Pos)) /* Assigment of value for TXCOMP in the TWIHS_SR register */
#define TWIHS_SR_RXRDY_Pos                    _UINT32_(1)                                          /* (TWIHS_SR) Receive Holding Register Ready (cleared by reading TWIHS_RHR) Position */
#define TWIHS_SR_RXRDY_Msk                    (_UINT32_(0x1) << TWIHS_SR_RXRDY_Pos)                /* (TWIHS_SR) Receive Holding Register Ready (cleared by reading TWIHS_RHR) Mask */
#define TWIHS_SR_RXRDY(value)                 (TWIHS_SR_RXRDY_Msk & (_UINT32_(value) << TWIHS_SR_RXRDY_Pos)) /* Assigment of value for RXRDY in the TWIHS_SR register */
#define TWIHS_SR_TXRDY_Pos                    _UINT32_(2)                                          /* (TWIHS_SR) Transmit Holding Register Ready (cleared by writing TWIHS_THR) Position */
#define TWIHS_SR_TXRDY_Msk                    (_UINT32_(0x1) << TWIHS_SR_TXRDY_Pos)                /* (TWIHS_SR) Transmit Holding Register Ready (cleared by writing TWIHS_THR) Mask */
#define TWIHS_SR_TXRDY(value)                 (TWIHS_SR_TXRDY_Msk & (_UINT32_(value) << TWIHS_SR_TXRDY_Pos)) /* Assigment of value for TXRDY in the TWIHS_SR register */
#define TWIHS_SR_SVREAD_Pos                   _UINT32_(3)                                          /* (TWIHS_SR) Slave Read Position */
#define TWIHS_SR_SVREAD_Msk                   (_UINT32_(0x1) << TWIHS_SR_SVREAD_Pos)               /* (TWIHS_SR) Slave Read Mask */
#define TWIHS_SR_SVREAD(value)                (TWIHS_SR_SVREAD_Msk & (_UINT32_(value) << TWIHS_SR_SVREAD_Pos)) /* Assigment of value for SVREAD in the TWIHS_SR register */
#define TWIHS_SR_SVACC_Pos                    _UINT32_(4)                                          /* (TWIHS_SR) Slave Access Position */
#define TWIHS_SR_SVACC_Msk                    (_UINT32_(0x1) << TWIHS_SR_SVACC_Pos)                /* (TWIHS_SR) Slave Access Mask */
#define TWIHS_SR_SVACC(value)                 (TWIHS_SR_SVACC_Msk & (_UINT32_(value) << TWIHS_SR_SVACC_Pos)) /* Assigment of value for SVACC in the TWIHS_SR register */
#define TWIHS_SR_GACC_Pos                     _UINT32_(5)                                          /* (TWIHS_SR) General Call Access (cleared on read) Position */
#define TWIHS_SR_GACC_Msk                     (_UINT32_(0x1) << TWIHS_SR_GACC_Pos)                 /* (TWIHS_SR) General Call Access (cleared on read) Mask */
#define TWIHS_SR_GACC(value)                  (TWIHS_SR_GACC_Msk & (_UINT32_(value) << TWIHS_SR_GACC_Pos)) /* Assigment of value for GACC in the TWIHS_SR register */
#define TWIHS_SR_OVRE_Pos                     _UINT32_(6)                                          /* (TWIHS_SR) Overrun Error (cleared on read) Position */
#define TWIHS_SR_OVRE_Msk                     (_UINT32_(0x1) << TWIHS_SR_OVRE_Pos)                 /* (TWIHS_SR) Overrun Error (cleared on read) Mask */
#define TWIHS_SR_OVRE(value)                  (TWIHS_SR_OVRE_Msk & (_UINT32_(value) << TWIHS_SR_OVRE_Pos)) /* Assigment of value for OVRE in the TWIHS_SR register */
#define TWIHS_SR_UNRE_Pos                     _UINT32_(7)                                          /* (TWIHS_SR) Underrun Error (cleared on read) Position */
#define TWIHS_SR_UNRE_Msk                     (_UINT32_(0x1) << TWIHS_SR_UNRE_Pos)                 /* (TWIHS_SR) Underrun Error (cleared on read) Mask */
#define TWIHS_SR_UNRE(value)                  (TWIHS_SR_UNRE_Msk & (_UINT32_(value) << TWIHS_SR_UNRE_Pos)) /* Assigment of value for UNRE in the TWIHS_SR register */
#define TWIHS_SR_NACK_Pos                     _UINT32_(8)                                          /* (TWIHS_SR) Not Acknowledged (cleared on read) Position */
#define TWIHS_SR_NACK_Msk                     (_UINT32_(0x1) << TWIHS_SR_NACK_Pos)                 /* (TWIHS_SR) Not Acknowledged (cleared on read) Mask */
#define TWIHS_SR_NACK(value)                  (TWIHS_SR_NACK_Msk & (_UINT32_(value) << TWIHS_SR_NACK_Pos)) /* Assigment of value for NACK in the TWIHS_SR register */
#define TWIHS_SR_ARBLST_Pos                   _UINT32_(9)                                          /* (TWIHS_SR) Arbitration Lost (cleared on read) Position */
#define TWIHS_SR_ARBLST_Msk                   (_UINT32_(0x1) << TWIHS_SR_ARBLST_Pos)               /* (TWIHS_SR) Arbitration Lost (cleared on read) Mask */
#define TWIHS_SR_ARBLST(value)                (TWIHS_SR_ARBLST_Msk & (_UINT32_(value) << TWIHS_SR_ARBLST_Pos)) /* Assigment of value for ARBLST in the TWIHS_SR register */
#define TWIHS_SR_SCLWS_Pos                    _UINT32_(10)                                         /* (TWIHS_SR) Clock Wait State Position */
#define TWIHS_SR_SCLWS_Msk                    (_UINT32_(0x1) << TWIHS_SR_SCLWS_Pos)                /* (TWIHS_SR) Clock Wait State Mask */
#define TWIHS_SR_SCLWS(value)                 (TWIHS_SR_SCLWS_Msk & (_UINT32_(value) << TWIHS_SR_SCLWS_Pos)) /* Assigment of value for SCLWS in the TWIHS_SR register */
#define TWIHS_SR_EOSACC_Pos                   _UINT32_(11)                                         /* (TWIHS_SR) End Of Slave Access (cleared on read) Position */
#define TWIHS_SR_EOSACC_Msk                   (_UINT32_(0x1) << TWIHS_SR_EOSACC_Pos)               /* (TWIHS_SR) End Of Slave Access (cleared on read) Mask */
#define TWIHS_SR_EOSACC(value)                (TWIHS_SR_EOSACC_Msk & (_UINT32_(value) << TWIHS_SR_EOSACC_Pos)) /* Assigment of value for EOSACC in the TWIHS_SR register */
#define TWIHS_SR_MCACK_Pos                    _UINT32_(16)                                         /* (TWIHS_SR) Master Code Acknowledge (cleared on read) Position */
#define TWIHS_SR_MCACK_Msk                    (_UINT32_(0x1) << TWIHS_SR_MCACK_Pos)                /* (TWIHS_SR) Master Code Acknowledge (cleared on read) Mask */
#define TWIHS_SR_MCACK(value)                 (TWIHS_SR_MCACK_Msk & (_UINT32_(value) << TWIHS_SR_MCACK_Pos)) /* Assigment of value for MCACK in the TWIHS_SR register */
#define TWIHS_SR_TOUT_Pos                     _UINT32_(18)                                         /* (TWIHS_SR) Timeout Error (cleared on read) Position */
#define TWIHS_SR_TOUT_Msk                     (_UINT32_(0x1) << TWIHS_SR_TOUT_Pos)                 /* (TWIHS_SR) Timeout Error (cleared on read) Mask */
#define TWIHS_SR_TOUT(value)                  (TWIHS_SR_TOUT_Msk & (_UINT32_(value) << TWIHS_SR_TOUT_Pos)) /* Assigment of value for TOUT in the TWIHS_SR register */
#define TWIHS_SR_PECERR_Pos                   _UINT32_(19)                                         /* (TWIHS_SR) PEC Error (cleared on read) Position */
#define TWIHS_SR_PECERR_Msk                   (_UINT32_(0x1) << TWIHS_SR_PECERR_Pos)               /* (TWIHS_SR) PEC Error (cleared on read) Mask */
#define TWIHS_SR_PECERR(value)                (TWIHS_SR_PECERR_Msk & (_UINT32_(value) << TWIHS_SR_PECERR_Pos)) /* Assigment of value for PECERR in the TWIHS_SR register */
#define TWIHS_SR_SMBDAM_Pos                   _UINT32_(20)                                         /* (TWIHS_SR) SMBus Default Address Match (cleared on read) Position */
#define TWIHS_SR_SMBDAM_Msk                   (_UINT32_(0x1) << TWIHS_SR_SMBDAM_Pos)               /* (TWIHS_SR) SMBus Default Address Match (cleared on read) Mask */
#define TWIHS_SR_SMBDAM(value)                (TWIHS_SR_SMBDAM_Msk & (_UINT32_(value) << TWIHS_SR_SMBDAM_Pos)) /* Assigment of value for SMBDAM in the TWIHS_SR register */
#define TWIHS_SR_SMBHHM_Pos                   _UINT32_(21)                                         /* (TWIHS_SR) SMBus Host Header Address Match (cleared on read) Position */
#define TWIHS_SR_SMBHHM_Msk                   (_UINT32_(0x1) << TWIHS_SR_SMBHHM_Pos)               /* (TWIHS_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define TWIHS_SR_SMBHHM(value)                (TWIHS_SR_SMBHHM_Msk & (_UINT32_(value) << TWIHS_SR_SMBHHM_Pos)) /* Assigment of value for SMBHHM in the TWIHS_SR register */
#define TWIHS_SR_LOCK_Pos                     _UINT32_(23)                                         /* (TWIHS_SR) TWIHS Lock due to Frame Errors (cleared by writing a one to bit LOCKCLR in TWIHS_CR) Position */
#define TWIHS_SR_LOCK_Msk                     (_UINT32_(0x1) << TWIHS_SR_LOCK_Pos)                 /* (TWIHS_SR) TWIHS Lock due to Frame Errors (cleared by writing a one to bit LOCKCLR in TWIHS_CR) Mask */
#define TWIHS_SR_LOCK(value)                  (TWIHS_SR_LOCK_Msk & (_UINT32_(value) << TWIHS_SR_LOCK_Pos)) /* Assigment of value for LOCK in the TWIHS_SR register */
#define TWIHS_SR_SCL_Pos                      _UINT32_(24)                                         /* (TWIHS_SR) SCL Line Value Position */
#define TWIHS_SR_SCL_Msk                      (_UINT32_(0x1) << TWIHS_SR_SCL_Pos)                  /* (TWIHS_SR) SCL Line Value Mask */
#define TWIHS_SR_SCL(value)                   (TWIHS_SR_SCL_Msk & (_UINT32_(value) << TWIHS_SR_SCL_Pos)) /* Assigment of value for SCL in the TWIHS_SR register */
#define TWIHS_SR_SDA_Pos                      _UINT32_(25)                                         /* (TWIHS_SR) SDA Line Value Position */
#define TWIHS_SR_SDA_Msk                      (_UINT32_(0x1) << TWIHS_SR_SDA_Pos)                  /* (TWIHS_SR) SDA Line Value Mask */
#define TWIHS_SR_SDA(value)                   (TWIHS_SR_SDA_Msk & (_UINT32_(value) << TWIHS_SR_SDA_Pos)) /* Assigment of value for SDA in the TWIHS_SR register */
#define TWIHS_SR_Msk                          _UINT32_(0x03BD0FFF)                                 /* (TWIHS_SR) Register Mask  */

/* FIFO_ENABLED mode */
#define TWIHS_SR_FIFO_ENABLED_TXCOMP_Pos      _UINT32_(0)                                          /* (TWIHS_SR) Transmission Completed (cleared by writing TWIHS_THR) Position */
#define TWIHS_SR_FIFO_ENABLED_TXCOMP_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_TXCOMP_Pos)  /* (TWIHS_SR) Transmission Completed (cleared by writing TWIHS_THR) Mask */
#define TWIHS_SR_FIFO_ENABLED_TXCOMP(value)   (TWIHS_SR_FIFO_ENABLED_TXCOMP_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_TXCOMP_Pos))
#define TWIHS_SR_FIFO_ENABLED_RXRDY_Pos       _UINT32_(1)                                          /* (TWIHS_SR) Receive Holding Register Ready (cleared by reading TWIHS_RHR) Position */
#define TWIHS_SR_FIFO_ENABLED_RXRDY_Msk       (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_RXRDY_Pos)   /* (TWIHS_SR) Receive Holding Register Ready (cleared by reading TWIHS_RHR) Mask */
#define TWIHS_SR_FIFO_ENABLED_RXRDY(value)    (TWIHS_SR_FIFO_ENABLED_RXRDY_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_RXRDY_Pos))
#define TWIHS_SR_FIFO_ENABLED_TXRDY_Pos       _UINT32_(2)                                          /* (TWIHS_SR) Transmit Holding Register Ready (cleared by writing TWIHS_THR) Position */
#define TWIHS_SR_FIFO_ENABLED_TXRDY_Msk       (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_TXRDY_Pos)   /* (TWIHS_SR) Transmit Holding Register Ready (cleared by writing TWIHS_THR) Mask */
#define TWIHS_SR_FIFO_ENABLED_TXRDY(value)    (TWIHS_SR_FIFO_ENABLED_TXRDY_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_TXRDY_Pos))
#define TWIHS_SR_FIFO_ENABLED_SVREAD_Pos      _UINT32_(3)                                          /* (TWIHS_SR) Slave Read Position */
#define TWIHS_SR_FIFO_ENABLED_SVREAD_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SVREAD_Pos)  /* (TWIHS_SR) Slave Read Mask */
#define TWIHS_SR_FIFO_ENABLED_SVREAD(value)   (TWIHS_SR_FIFO_ENABLED_SVREAD_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SVREAD_Pos))
#define TWIHS_SR_FIFO_ENABLED_SVACC_Pos       _UINT32_(4)                                          /* (TWIHS_SR) Slave Access Position */
#define TWIHS_SR_FIFO_ENABLED_SVACC_Msk       (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SVACC_Pos)   /* (TWIHS_SR) Slave Access Mask */
#define TWIHS_SR_FIFO_ENABLED_SVACC(value)    (TWIHS_SR_FIFO_ENABLED_SVACC_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SVACC_Pos))
#define TWIHS_SR_FIFO_ENABLED_GACC_Pos        _UINT32_(5)                                          /* (TWIHS_SR) General Call Access (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_GACC_Msk        (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_GACC_Pos)    /* (TWIHS_SR) General Call Access (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_GACC(value)     (TWIHS_SR_FIFO_ENABLED_GACC_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_GACC_Pos))
#define TWIHS_SR_FIFO_ENABLED_OVRE_Pos        _UINT32_(6)                                          /* (TWIHS_SR) Overrun Error (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_OVRE_Msk        (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_OVRE_Pos)    /* (TWIHS_SR) Overrun Error (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_OVRE(value)     (TWIHS_SR_FIFO_ENABLED_OVRE_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_OVRE_Pos))
#define TWIHS_SR_FIFO_ENABLED_UNRE_Pos        _UINT32_(7)                                          /* (TWIHS_SR) Underrun Error (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_UNRE_Msk        (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_UNRE_Pos)    /* (TWIHS_SR) Underrun Error (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_UNRE(value)     (TWIHS_SR_FIFO_ENABLED_UNRE_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_UNRE_Pos))
#define TWIHS_SR_FIFO_ENABLED_NACK_Pos        _UINT32_(8)                                          /* (TWIHS_SR) Not Acknowledged (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_NACK_Msk        (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_NACK_Pos)    /* (TWIHS_SR) Not Acknowledged (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_NACK(value)     (TWIHS_SR_FIFO_ENABLED_NACK_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_NACK_Pos))
#define TWIHS_SR_FIFO_ENABLED_ARBLST_Pos      _UINT32_(9)                                          /* (TWIHS_SR) Arbitration Lost (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_ARBLST_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_ARBLST_Pos)  /* (TWIHS_SR) Arbitration Lost (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_ARBLST(value)   (TWIHS_SR_FIFO_ENABLED_ARBLST_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_ARBLST_Pos))
#define TWIHS_SR_FIFO_ENABLED_SCLWS_Pos       _UINT32_(10)                                         /* (TWIHS_SR) Clock Wait State Position */
#define TWIHS_SR_FIFO_ENABLED_SCLWS_Msk       (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SCLWS_Pos)   /* (TWIHS_SR) Clock Wait State Mask */
#define TWIHS_SR_FIFO_ENABLED_SCLWS(value)    (TWIHS_SR_FIFO_ENABLED_SCLWS_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SCLWS_Pos))
#define TWIHS_SR_FIFO_ENABLED_EOSACC_Pos      _UINT32_(11)                                         /* (TWIHS_SR) End Of Slave Access (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_EOSACC_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_EOSACC_Pos)  /* (TWIHS_SR) End Of Slave Access (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_EOSACC(value)   (TWIHS_SR_FIFO_ENABLED_EOSACC_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_EOSACC_Pos))
#define TWIHS_SR_FIFO_ENABLED_MCACK_Pos       _UINT32_(16)                                         /* (TWIHS_SR) Master Code Acknowledge (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_MCACK_Msk       (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_MCACK_Pos)   /* (TWIHS_SR) Master Code Acknowledge (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_MCACK(value)    (TWIHS_SR_FIFO_ENABLED_MCACK_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_MCACK_Pos))
#define TWIHS_SR_FIFO_ENABLED_TOUT_Pos        _UINT32_(18)                                         /* (TWIHS_SR) Timeout Error (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_TOUT_Msk        (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_TOUT_Pos)    /* (TWIHS_SR) Timeout Error (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_TOUT(value)     (TWIHS_SR_FIFO_ENABLED_TOUT_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_TOUT_Pos))
#define TWIHS_SR_FIFO_ENABLED_PECERR_Pos      _UINT32_(19)                                         /* (TWIHS_SR) PEC Error (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_PECERR_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_PECERR_Pos)  /* (TWIHS_SR) PEC Error (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_PECERR(value)   (TWIHS_SR_FIFO_ENABLED_PECERR_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_PECERR_Pos))
#define TWIHS_SR_FIFO_ENABLED_SMBDAM_Pos      _UINT32_(20)                                         /* (TWIHS_SR) SMBus Default Address Match (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_SMBDAM_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SMBDAM_Pos)  /* (TWIHS_SR) SMBus Default Address Match (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_SMBDAM(value)   (TWIHS_SR_FIFO_ENABLED_SMBDAM_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SMBDAM_Pos))
#define TWIHS_SR_FIFO_ENABLED_SMBHHM_Pos      _UINT32_(21)                                         /* (TWIHS_SR) SMBus Host Header Address Match (cleared on read) Position */
#define TWIHS_SR_FIFO_ENABLED_SMBHHM_Msk      (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SMBHHM_Pos)  /* (TWIHS_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define TWIHS_SR_FIFO_ENABLED_SMBHHM(value)   (TWIHS_SR_FIFO_ENABLED_SMBHHM_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SMBHHM_Pos))
#define TWIHS_SR_FIFO_ENABLED_TXFLOCK_Pos     _UINT32_(23)                                         /* (TWIHS_SR) Transmit FIFO Lock Position */
#define TWIHS_SR_FIFO_ENABLED_TXFLOCK_Msk     (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_TXFLOCK_Pos) /* (TWIHS_SR) Transmit FIFO Lock Mask */
#define TWIHS_SR_FIFO_ENABLED_TXFLOCK(value)  (TWIHS_SR_FIFO_ENABLED_TXFLOCK_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_TXFLOCK_Pos))
#define TWIHS_SR_FIFO_ENABLED_SCL_Pos         _UINT32_(24)                                         /* (TWIHS_SR) SCL Line Value Position */
#define TWIHS_SR_FIFO_ENABLED_SCL_Msk         (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SCL_Pos)     /* (TWIHS_SR) SCL Line Value Mask */
#define TWIHS_SR_FIFO_ENABLED_SCL(value)      (TWIHS_SR_FIFO_ENABLED_SCL_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SCL_Pos))
#define TWIHS_SR_FIFO_ENABLED_SDA_Pos         _UINT32_(25)                                         /* (TWIHS_SR) SDA Line Value Position */
#define TWIHS_SR_FIFO_ENABLED_SDA_Msk         (_UINT32_(0x1) << TWIHS_SR_FIFO_ENABLED_SDA_Pos)     /* (TWIHS_SR) SDA Line Value Mask */
#define TWIHS_SR_FIFO_ENABLED_SDA(value)      (TWIHS_SR_FIFO_ENABLED_SDA_Msk & (_UINT32_(value) << TWIHS_SR_FIFO_ENABLED_SDA_Pos))
#define TWIHS_SR_FIFO_ENABLED_Msk             _UINT32_(0x03BD0FFF)                                  /* (TWIHS_SR_FIFO_ENABLED) Register Mask  */


