Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/twihs.h
/* -------- TWIHS_FSR : (TWIHS Offset: 0x60) ( R/ 32) FIFO Status Register -------- */
#define TWIHS_FSR_TXFEF_Pos                   _UINT32_(0)                                          /* (TWIHS_FSR) Transmit FIFO Empty Flag (cleared on read) Position */
#define TWIHS_FSR_TXFEF_Msk                   (_UINT32_(0x1) << TWIHS_FSR_TXFEF_Pos)               /* (TWIHS_FSR) Transmit FIFO Empty Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFEF(value)                (TWIHS_FSR_TXFEF_Msk & (_UINT32_(value) << TWIHS_FSR_TXFEF_Pos)) /* Assigment of value for TXFEF in the TWIHS_FSR register */
#define TWIHS_FSR_TXFFF_Pos                   _UINT32_(1)                                          /* (TWIHS_FSR) Transmit FIFO Full Flag (cleared on read) Position */
#define TWIHS_FSR_TXFFF_Msk                   (_UINT32_(0x1) << TWIHS_FSR_TXFFF_Pos)               /* (TWIHS_FSR) Transmit FIFO Full Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFFF(value)                (TWIHS_FSR_TXFFF_Msk & (_UINT32_(value) << TWIHS_FSR_TXFFF_Pos)) /* Assigment of value for TXFFF in the TWIHS_FSR register */
#define TWIHS_FSR_TXFTHF_Pos                  _UINT32_(2)                                          /* (TWIHS_FSR) Transmit FIFO Threshold Flag (cleared on read) Position */
#define TWIHS_FSR_TXFTHF_Msk                  (_UINT32_(0x1) << TWIHS_FSR_TXFTHF_Pos)              /* (TWIHS_FSR) Transmit FIFO Threshold Flag (cleared on read) Mask */
#define TWIHS_FSR_TXFTHF(value)               (TWIHS_FSR_TXFTHF_Msk & (_UINT32_(value) << TWIHS_FSR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the TWIHS_FSR register */
#define TWIHS_FSR_RXFEF_Pos                   _UINT32_(3)                                          /* (TWIHS_FSR) Receive FIFO Empty Flag Position */
#define TWIHS_FSR_RXFEF_Msk                   (_UINT32_(0x1) << TWIHS_FSR_RXFEF_Pos)               /* (TWIHS_FSR) Receive FIFO Empty Flag Mask */
#define TWIHS_FSR_RXFEF(value)                (TWIHS_FSR_RXFEF_Msk & (_UINT32_(value) << TWIHS_FSR_RXFEF_Pos)) /* Assigment of value for RXFEF in the TWIHS_FSR register */
#define TWIHS_FSR_RXFFF_Pos                   _UINT32_(4)                                          /* (TWIHS_FSR) Receive FIFO Full Flag Position */
#define TWIHS_FSR_RXFFF_Msk                   (_UINT32_(0x1) << TWIHS_FSR_RXFFF_Pos)               /* (TWIHS_FSR) Receive FIFO Full Flag Mask */
#define TWIHS_FSR_RXFFF(value)                (TWIHS_FSR_RXFFF_Msk & (_UINT32_(value) << TWIHS_FSR_RXFFF_Pos)) /* Assigment of value for RXFFF in the TWIHS_FSR register */
#define TWIHS_FSR_RXFTHF_Pos                  _UINT32_(5)                                          /* (TWIHS_FSR) Receive FIFO Threshold Flag Position */
#define TWIHS_FSR_RXFTHF_Msk                  (_UINT32_(0x1) << TWIHS_FSR_RXFTHF_Pos)              /* (TWIHS_FSR) Receive FIFO Threshold Flag Mask */
#define TWIHS_FSR_RXFTHF(value)               (TWIHS_FSR_RXFTHF_Msk & (_UINT32_(value) << TWIHS_FSR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the TWIHS_FSR register */
#define TWIHS_FSR_TXFPTEF_Pos                 _UINT32_(6)                                          /* (TWIHS_FSR) Transmit FIFO Pointer Error Flag Position */
#define TWIHS_FSR_TXFPTEF_Msk                 (_UINT32_(0x1) << TWIHS_FSR_TXFPTEF_Pos)             /* (TWIHS_FSR) Transmit FIFO Pointer Error Flag Mask */
#define TWIHS_FSR_TXFPTEF(value)              (TWIHS_FSR_TXFPTEF_Msk & (_UINT32_(value) << TWIHS_FSR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the TWIHS_FSR register */
#define TWIHS_FSR_RXFPTEF_Pos                 _UINT32_(7)                                          /* (TWIHS_FSR) Receive FIFO Pointer Error Flag Position */
#define TWIHS_FSR_RXFPTEF_Msk                 (_UINT32_(0x1) << TWIHS_FSR_RXFPTEF_Pos)             /* (TWIHS_FSR) Receive FIFO Pointer Error Flag Mask */
#define TWIHS_FSR_RXFPTEF(value)              (TWIHS_FSR_RXFPTEF_Msk & (_UINT32_(value) << TWIHS_FSR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the TWIHS_FSR register */
#define TWIHS_FSR_Msk                         _UINT32_(0x000000FF)                                 /* (TWIHS_FSR) Register Mask  */


/* -------- TWIHS_FIER : (TWIHS Offset: 0x64) ( /W 32) FIFO Interrupt Enable Register -------- */
#define TWIHS_FIER_TXFEF_Pos                  _UINT32_(0)                                          /* (TWIHS_FIER) TXFEF Interrupt Enable Position */
#define TWIHS_FIER_TXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIER_TXFEF_Pos)              /* (TWIHS_FIER) TXFEF Interrupt Enable Mask */
#define TWIHS_FIER_TXFEF(value)               (TWIHS_FIER_TXFEF_Msk & (_UINT32_(value) << TWIHS_FIER_TXFEF_Pos)) /* Assigment of value for TXFEF in the TWIHS_FIER register */
#define TWIHS_FIER_TXFFF_Pos                  _UINT32_(1)                                          /* (TWIHS_FIER) TXFFF Interrupt Enable Position */
#define TWIHS_FIER_TXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIER_TXFFF_Pos)              /* (TWIHS_FIER) TXFFF Interrupt Enable Mask */
#define TWIHS_FIER_TXFFF(value)               (TWIHS_FIER_TXFFF_Msk & (_UINT32_(value) << TWIHS_FIER_TXFFF_Pos)) /* Assigment of value for TXFFF in the TWIHS_FIER register */
#define TWIHS_FIER_TXFTHF_Pos                 _UINT32_(2)                                          /* (TWIHS_FIER) TXFTHF Interrupt Enable Position */
#define TWIHS_FIER_TXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIER_TXFTHF_Pos)             /* (TWIHS_FIER) TXFTHF Interrupt Enable Mask */
#define TWIHS_FIER_TXFTHF(value)              (TWIHS_FIER_TXFTHF_Msk & (_UINT32_(value) << TWIHS_FIER_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the TWIHS_FIER register */
#define TWIHS_FIER_RXFEF_Pos                  _UINT32_(3)                                          /* (TWIHS_FIER) RXFEF Interrupt Enable Position */
#define TWIHS_FIER_RXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIER_RXFEF_Pos)              /* (TWIHS_FIER) RXFEF Interrupt Enable Mask */
#define TWIHS_FIER_RXFEF(value)               (TWIHS_FIER_RXFEF_Msk & (_UINT32_(value) << TWIHS_FIER_RXFEF_Pos)) /* Assigment of value for RXFEF in the TWIHS_FIER register */
#define TWIHS_FIER_RXFFF_Pos                  _UINT32_(4)                                          /* (TWIHS_FIER) RXFFF Interrupt Enable Position */
#define TWIHS_FIER_RXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIER_RXFFF_Pos)              /* (TWIHS_FIER) RXFFF Interrupt Enable Mask */
#define TWIHS_FIER_RXFFF(value)               (TWIHS_FIER_RXFFF_Msk & (_UINT32_(value) << TWIHS_FIER_RXFFF_Pos)) /* Assigment of value for RXFFF in the TWIHS_FIER register */
#define TWIHS_FIER_RXFTHF_Pos                 _UINT32_(5)                                          /* (TWIHS_FIER) RXFTHF Interrupt Enable Position */
#define TWIHS_FIER_RXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIER_RXFTHF_Pos)             /* (TWIHS_FIER) RXFTHF Interrupt Enable Mask */
#define TWIHS_FIER_RXFTHF(value)              (TWIHS_FIER_RXFTHF_Msk & (_UINT32_(value) << TWIHS_FIER_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the TWIHS_FIER register */
#define TWIHS_FIER_TXFPTEF_Pos                _UINT32_(6)                                          /* (TWIHS_FIER) TXFPTEF Interrupt Enable Position */
#define TWIHS_FIER_TXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIER_TXFPTEF_Pos)            /* (TWIHS_FIER) TXFPTEF Interrupt Enable Mask */
#define TWIHS_FIER_TXFPTEF(value)             (TWIHS_FIER_TXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIER_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the TWIHS_FIER register */
#define TWIHS_FIER_RXFPTEF_Pos                _UINT32_(7)                                          /* (TWIHS_FIER) RXFPTEF Interrupt Enable Position */
#define TWIHS_FIER_RXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIER_RXFPTEF_Pos)            /* (TWIHS_FIER) RXFPTEF Interrupt Enable Mask */
#define TWIHS_FIER_RXFPTEF(value)             (TWIHS_FIER_RXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIER_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the TWIHS_FIER register */
#define TWIHS_FIER_Msk                        _UINT32_(0x000000FF)                                 /* (TWIHS_FIER) Register Mask  */


/* -------- TWIHS_FIDR : (TWIHS Offset: 0x68) ( /W 32) FIFO Interrupt Disable Register -------- */
#define TWIHS_FIDR_TXFEF_Pos                  _UINT32_(0)                                          /* (TWIHS_FIDR) TXFEF Interrupt Disable Position */
#define TWIHS_FIDR_TXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIDR_TXFEF_Pos)              /* (TWIHS_FIDR) TXFEF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFEF(value)               (TWIHS_FIDR_TXFEF_Msk & (_UINT32_(value) << TWIHS_FIDR_TXFEF_Pos)) /* Assigment of value for TXFEF in the TWIHS_FIDR register */
#define TWIHS_FIDR_TXFFF_Pos                  _UINT32_(1)                                          /* (TWIHS_FIDR) TXFFF Interrupt Disable Position */
#define TWIHS_FIDR_TXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIDR_TXFFF_Pos)              /* (TWIHS_FIDR) TXFFF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFFF(value)               (TWIHS_FIDR_TXFFF_Msk & (_UINT32_(value) << TWIHS_FIDR_TXFFF_Pos)) /* Assigment of value for TXFFF in the TWIHS_FIDR register */
#define TWIHS_FIDR_TXFTHF_Pos                 _UINT32_(2)                                          /* (TWIHS_FIDR) TXFTHF Interrupt Disable Position */
#define TWIHS_FIDR_TXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIDR_TXFTHF_Pos)             /* (TWIHS_FIDR) TXFTHF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFTHF(value)              (TWIHS_FIDR_TXFTHF_Msk & (_UINT32_(value) << TWIHS_FIDR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the TWIHS_FIDR register */
#define TWIHS_FIDR_RXFEF_Pos                  _UINT32_(3)                                          /* (TWIHS_FIDR) RXFEF Interrupt Disable Position */
#define TWIHS_FIDR_RXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIDR_RXFEF_Pos)              /* (TWIHS_FIDR) RXFEF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFEF(value)               (TWIHS_FIDR_RXFEF_Msk & (_UINT32_(value) << TWIHS_FIDR_RXFEF_Pos)) /* Assigment of value for RXFEF in the TWIHS_FIDR register */
#define TWIHS_FIDR_RXFFF_Pos                  _UINT32_(4)                                          /* (TWIHS_FIDR) RXFFF Interrupt Disable Position */
#define TWIHS_FIDR_RXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIDR_RXFFF_Pos)              /* (TWIHS_FIDR) RXFFF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFFF(value)               (TWIHS_FIDR_RXFFF_Msk & (_UINT32_(value) << TWIHS_FIDR_RXFFF_Pos)) /* Assigment of value for RXFFF in the TWIHS_FIDR register */
#define TWIHS_FIDR_RXFTHF_Pos                 _UINT32_(5)                                          /* (TWIHS_FIDR) RXFTHF Interrupt Disable Position */
#define TWIHS_FIDR_RXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIDR_RXFTHF_Pos)             /* (TWIHS_FIDR) RXFTHF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFTHF(value)              (TWIHS_FIDR_RXFTHF_Msk & (_UINT32_(value) << TWIHS_FIDR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the TWIHS_FIDR register */
#define TWIHS_FIDR_TXFPTEF_Pos                _UINT32_(6)                                          /* (TWIHS_FIDR) TXFPTEF Interrupt Disable Position */
#define TWIHS_FIDR_TXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIDR_TXFPTEF_Pos)            /* (TWIHS_FIDR) TXFPTEF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFPTEF(value)             (TWIHS_FIDR_TXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIDR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the TWIHS_FIDR register */
#define TWIHS_FIDR_RXFPTEF_Pos                _UINT32_(7)                                          /* (TWIHS_FIDR) RXFPTEF Interrupt Disable Position */
#define TWIHS_FIDR_RXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIDR_RXFPTEF_Pos)            /* (TWIHS_FIDR) RXFPTEF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFPTEF(value)             (TWIHS_FIDR_RXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIDR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the TWIHS_FIDR register */
#define TWIHS_FIDR_Msk                        _UINT32_(0x000000FF)                                 /* (TWIHS_FIDR) Register Mask  */


