Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/component/twihs.h
/* -------- TWIHS_FIMR : (TWIHS Offset: 0x6C) ( R/ 32) FIFO Interrupt Mask Register -------- */
#define TWIHS_FIMR_TXFEF_Pos                  _UINT32_(0)                                          /* (TWIHS_FIMR) TXFEF Interrupt Mask Position */
#define TWIHS_FIMR_TXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIMR_TXFEF_Pos)              /* (TWIHS_FIMR) TXFEF Interrupt Mask Mask */
#define TWIHS_FIMR_TXFEF(value)               (TWIHS_FIMR_TXFEF_Msk & (_UINT32_(value) << TWIHS_FIMR_TXFEF_Pos)) /* Assigment of value for TXFEF in the TWIHS_FIMR register */
#define TWIHS_FIMR_TXFFF_Pos                  _UINT32_(1)                                          /* (TWIHS_FIMR) TXFFF Interrupt Mask Position */
#define TWIHS_FIMR_TXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIMR_TXFFF_Pos)              /* (TWIHS_FIMR) TXFFF Interrupt Mask Mask */
#define TWIHS_FIMR_TXFFF(value)               (TWIHS_FIMR_TXFFF_Msk & (_UINT32_(value) << TWIHS_FIMR_TXFFF_Pos)) /* Assigment of value for TXFFF in the TWIHS_FIMR register */
#define TWIHS_FIMR_TXFTHF_Pos                 _UINT32_(2)                                          /* (TWIHS_FIMR) TXFTHF Interrupt Mask Position */
#define TWIHS_FIMR_TXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIMR_TXFTHF_Pos)             /* (TWIHS_FIMR) TXFTHF Interrupt Mask Mask */
#define TWIHS_FIMR_TXFTHF(value)              (TWIHS_FIMR_TXFTHF_Msk & (_UINT32_(value) << TWIHS_FIMR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the TWIHS_FIMR register */
#define TWIHS_FIMR_RXFEF_Pos                  _UINT32_(3)                                          /* (TWIHS_FIMR) RXFEF Interrupt Mask Position */
#define TWIHS_FIMR_RXFEF_Msk                  (_UINT32_(0x1) << TWIHS_FIMR_RXFEF_Pos)              /* (TWIHS_FIMR) RXFEF Interrupt Mask Mask */
#define TWIHS_FIMR_RXFEF(value)               (TWIHS_FIMR_RXFEF_Msk & (_UINT32_(value) << TWIHS_FIMR_RXFEF_Pos)) /* Assigment of value for RXFEF in the TWIHS_FIMR register */
#define TWIHS_FIMR_RXFFF_Pos                  _UINT32_(4)                                          /* (TWIHS_FIMR) RXFFF Interrupt Mask Position */
#define TWIHS_FIMR_RXFFF_Msk                  (_UINT32_(0x1) << TWIHS_FIMR_RXFFF_Pos)              /* (TWIHS_FIMR) RXFFF Interrupt Mask Mask */
#define TWIHS_FIMR_RXFFF(value)               (TWIHS_FIMR_RXFFF_Msk & (_UINT32_(value) << TWIHS_FIMR_RXFFF_Pos)) /* Assigment of value for RXFFF in the TWIHS_FIMR register */
#define TWIHS_FIMR_RXFTHF_Pos                 _UINT32_(5)                                          /* (TWIHS_FIMR) RXFTHF Interrupt Mask Position */
#define TWIHS_FIMR_RXFTHF_Msk                 (_UINT32_(0x1) << TWIHS_FIMR_RXFTHF_Pos)             /* (TWIHS_FIMR) RXFTHF Interrupt Mask Mask */
#define TWIHS_FIMR_RXFTHF(value)              (TWIHS_FIMR_RXFTHF_Msk & (_UINT32_(value) << TWIHS_FIMR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the TWIHS_FIMR register */
#define TWIHS_FIMR_TXFPTEF_Pos                _UINT32_(6)                                          /* (TWIHS_FIMR) TXFPTEF Interrupt Mask Position */
#define TWIHS_FIMR_TXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIMR_TXFPTEF_Pos)            /* (TWIHS_FIMR) TXFPTEF Interrupt Mask Mask */
#define TWIHS_FIMR_TXFPTEF(value)             (TWIHS_FIMR_TXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIMR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the TWIHS_FIMR register */
#define TWIHS_FIMR_RXFPTEF_Pos                _UINT32_(7)                                          /* (TWIHS_FIMR) RXFPTEF Interrupt Mask Position */
#define TWIHS_FIMR_RXFPTEF_Msk                (_UINT32_(0x1) << TWIHS_FIMR_RXFPTEF_Pos)            /* (TWIHS_FIMR) RXFPTEF Interrupt Mask Mask */
#define TWIHS_FIMR_RXFPTEF(value)             (TWIHS_FIMR_RXFPTEF_Msk & (_UINT32_(value) << TWIHS_FIMR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the TWIHS_FIMR register */
#define TWIHS_FIMR_Msk                        _UINT32_(0x000000FF)                                 /* (TWIHS_FIMR) Register Mask  */


/* -------- TWIHS_DR : (TWIHS Offset: 0xD0) ( R/ 32) Debug Register -------- */
#define TWIHS_DR_SWEN_Pos                     _UINT32_(0)                                          /* (TWIHS_DR) SleepWalking Enable Position */
#define TWIHS_DR_SWEN_Msk                     (_UINT32_(0x1) << TWIHS_DR_SWEN_Pos)                 /* (TWIHS_DR) SleepWalking Enable Mask */
#define TWIHS_DR_SWEN(value)                  (TWIHS_DR_SWEN_Msk & (_UINT32_(value) << TWIHS_DR_SWEN_Pos)) /* Assigment of value for SWEN in the TWIHS_DR register */
#define TWIHS_DR_CLKRQ_Pos                    _UINT32_(1)                                          /* (TWIHS_DR) Clock Request Position */
#define TWIHS_DR_CLKRQ_Msk                    (_UINT32_(0x1) << TWIHS_DR_CLKRQ_Pos)                /* (TWIHS_DR) Clock Request Mask */
#define TWIHS_DR_CLKRQ(value)                 (TWIHS_DR_CLKRQ_Msk & (_UINT32_(value) << TWIHS_DR_CLKRQ_Pos)) /* Assigment of value for CLKRQ in the TWIHS_DR register */
#define TWIHS_DR_SWMATCH_Pos                  _UINT32_(2)                                          /* (TWIHS_DR) SleepWalking Match Position */
#define TWIHS_DR_SWMATCH_Msk                  (_UINT32_(0x1) << TWIHS_DR_SWMATCH_Pos)              /* (TWIHS_DR) SleepWalking Match Mask */
#define TWIHS_DR_SWMATCH(value)               (TWIHS_DR_SWMATCH_Msk & (_UINT32_(value) << TWIHS_DR_SWMATCH_Pos)) /* Assigment of value for SWMATCH in the TWIHS_DR register */
#define TWIHS_DR_TRP_Pos                      _UINT32_(3)                                          /* (TWIHS_DR) Transfer Pending Position */
#define TWIHS_DR_TRP_Msk                      (_UINT32_(0x1) << TWIHS_DR_TRP_Pos)                  /* (TWIHS_DR) Transfer Pending Mask */
#define TWIHS_DR_TRP(value)                   (TWIHS_DR_TRP_Msk & (_UINT32_(value) << TWIHS_DR_TRP_Pos)) /* Assigment of value for TRP in the TWIHS_DR register */
#define TWIHS_DR_Msk                          _UINT32_(0x0000000F)                                 /* (TWIHS_DR) Register Mask  */


/* -------- TWIHS_WPMR : (TWIHS Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TWIHS_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (TWIHS_WPMR) Write Protection Enable Position */
#define TWIHS_WPMR_WPEN_Msk                   (_UINT32_(0x1) << TWIHS_WPMR_WPEN_Pos)               /* (TWIHS_WPMR) Write Protection Enable Mask */
#define TWIHS_WPMR_WPEN(value)                (TWIHS_WPMR_WPEN_Msk & (_UINT32_(value) << TWIHS_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the TWIHS_WPMR register */
#define TWIHS_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (TWIHS_WPMR) Write Protection Key Position */
#define TWIHS_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << TWIHS_WPMR_WPKEY_Pos)         /* (TWIHS_WPMR) Write Protection Key Mask */
#define TWIHS_WPMR_WPKEY(value)               (TWIHS_WPMR_WPKEY_Msk & (_UINT32_(value) << TWIHS_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the TWIHS_WPMR register */
#define   TWIHS_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x545749)                                   /* (TWIHS_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define TWIHS_WPMR_WPKEY_PASSWD               (TWIHS_WPMR_WPKEY_PASSWD_Val << TWIHS_WPMR_WPKEY_Pos) /* (TWIHS_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define TWIHS_WPMR_Msk                        _UINT32_(0xFFFFFF01)                                 /* (TWIHS_WPMR) Register Mask  */


/* -------- TWIHS_WPSR : (TWIHS Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define TWIHS_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (TWIHS_WPSR) Write Protection Violation Status Position */
#define TWIHS_WPSR_WPVS_Msk                   (_UINT32_(0x1) << TWIHS_WPSR_WPVS_Pos)               /* (TWIHS_WPSR) Write Protection Violation Status Mask */
#define TWIHS_WPSR_WPVS(value)                (TWIHS_WPSR_WPVS_Msk & (_UINT32_(value) << TWIHS_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the TWIHS_WPSR register */
#define TWIHS_WPSR_WPVSRC_Pos                 _UINT32_(8)                                          /* (TWIHS_WPSR) Write Protection Violation Source Position */
#define TWIHS_WPSR_WPVSRC_Msk                 (_UINT32_(0xFFFFFF) << TWIHS_WPSR_WPVSRC_Pos)        /* (TWIHS_WPSR) Write Protection Violation Source Mask */
#define TWIHS_WPSR_WPVSRC(value)              (TWIHS_WPSR_WPVSRC_Msk & (_UINT32_(value) << TWIHS_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the TWIHS_WPSR register */
#define TWIHS_WPSR_Msk                        _UINT32_(0xFFFFFF01)                                 /* (TWIHS_WPSR) Register Mask  */


/** \brief TWIHS register offsets definitions */
#define TWIHS_CR_REG_OFST              _UINT32_(0x00)      /* (TWIHS_CR) Control Register Offset */
#define TWIHS_MMR_REG_OFST             _UINT32_(0x04)      /* (TWIHS_MMR) Master Mode Register Offset */
#define TWIHS_SMR_REG_OFST             _UINT32_(0x08)      /* (TWIHS_SMR) Slave Mode Register Offset */
#define TWIHS_IADR_REG_OFST            _UINT32_(0x0C)      /* (TWIHS_IADR) Internal Address Register Offset */
#define TWIHS_CWGR_REG_OFST            _UINT32_(0x10)      /* (TWIHS_CWGR) Clock Waveform Generator Register Offset */
#define TWIHS_SR_REG_OFST              _UINT32_(0x20)      /* (TWIHS_SR) Status Register Offset */
#define TWIHS_IER_REG_OFST             _UINT32_(0x24)      /* (TWIHS_IER) Interrupt Enable Register Offset */
#define TWIHS_IDR_REG_OFST             _UINT32_(0x28)      /* (TWIHS_IDR) Interrupt Disable Register Offset */
#define TWIHS_IMR_REG_OFST             _UINT32_(0x2C)      /* (TWIHS_IMR) Interrupt Mask Register Offset */
#define TWIHS_RHR_REG_OFST             _UINT32_(0x30)      /* (TWIHS_RHR) Receive Holding Register Offset */
#define TWIHS_THR_REG_OFST             _UINT32_(0x34)      /* (TWIHS_THR) Transmit Holding Register Offset */
#define TWIHS_SMBTR_REG_OFST           _UINT32_(0x38)      /* (TWIHS_SMBTR) SMBus Timing Register Offset */
#define TWIHS_ACR_REG_OFST             _UINT32_(0x40)      /* (TWIHS_ACR) Alternative Command Register Offset */
#define TWIHS_FILTR_REG_OFST           _UINT32_(0x44)      /* (TWIHS_FILTR) Filter Register Offset */
#define TWIHS_SWMR_REG_OFST            _UINT32_(0x4C)      /* (TWIHS_SWMR) SleepWalking Matching Register Offset */
#define TWIHS_FMR_REG_OFST             _UINT32_(0x50)      /* (TWIHS_FMR) FIFO Mode Register Offset */
#define TWIHS_FLR_REG_OFST             _UINT32_(0x54)      /* (TWIHS_FLR) FIFO Level Register Offset */
#define TWIHS_FSR_REG_OFST             _UINT32_(0x60)      /* (TWIHS_FSR) FIFO Status Register Offset */
#define TWIHS_FIER_REG_OFST            _UINT32_(0x64)      /* (TWIHS_FIER) FIFO Interrupt Enable Register Offset */
#define TWIHS_FIDR_REG_OFST            _UINT32_(0x68)      /* (TWIHS_FIDR) FIFO Interrupt Disable Register Offset */
#define TWIHS_FIMR_REG_OFST            _UINT32_(0x6C)      /* (TWIHS_FIMR) FIFO Interrupt Mask Register Offset */
#define TWIHS_DR_REG_OFST              _UINT32_(0xD0)      /* (TWIHS_DR) Debug Register Offset */
#define TWIHS_WPMR_REG_OFST            _UINT32_(0xE4)      /* (TWIHS_WPMR) Write Protection Mode Register Offset */
#define TWIHS_WPSR_REG_OFST            _UINT32_(0xE8)      /* (TWIHS_WPSR) Write Protection Status Register Offset */

